      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 val PIC 99.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "inicio repaso".
            SET val TO 4.
            IF val >3
                  DISPLAY "es mayor"
            ELSE
                  DISPLAY "es menor".
       funcion1.
         DISPLAY "hola termine la funcion 1".



       END PROGRAM YOUR-PROGRAM-NAME.
